tests/taurus/directions/blockme-freeplan-walking-10.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 3m
  scenario: walking

scenarios:
  walking:
    requests:
        - url: https://api.openrouteservice.org/directions?coordinates=8.6724335,49.3987524%7C8.661249999999999,49.4737672&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=foot-walking&units=m&api_key=58d904a497c67e00015b45fcee245d943b474502537cf57c868d7476
          label: walking-10-Heidelberg-Schriesheim

reporting:
    - module: blazemeter
      report-name: OpenRouteService Directions API Concurrency Test