tests/taurus/directions/driving-api-gateway-https.yml
---
execution:
- concurrency: 2000
  ramp-up: 3m
  hold-for: 15m
  scenario: routing

scenarios:
  routing:
    requests:
    - https://api.openrouteservice.org/directions?profile=driving-car&coordinates=8.690614,49.38365%7C8.7007,49.411699%7C8.7107,49.45169&instructions=false&geometry_format=polyline&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe

reporting:
    - module: blazemeter
      report-name: OpenRouteService Routing API Concurrency Performance