tests/taurus/directions/driving-backend.yml
---
execution:
- concurrency: 2000
  ramp-up: 3m
  hold-for: 15m
  scenario: routing

scenarios:
  routing:
    requests:
    - http://192.168.2.11:8080/ors/routes?profile=driving-car&coordinates=8.690614,49.38365%7C8.7007,49.411699%7C8.7107,49.45169&instructions=false&geometry_format=polyline&api_key=f063f9a4600144b6b1c85356b24f4a63

reporting:
    - module: blazemeter
      report-name: OpenRouteService Routing API Concurrency Performance