tests/taurus/directions/driving-backend.yml
---
execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 5m
  scenario: driving

scenarios:
  driving:
    requests:
    - http://192.168.2.11:8080/ors/routes?profile=driving-car&coordinates=8.690614,49.38365%7C8.7007,49.411699%7C8.7107,49.45169&instructions=false&geometry_format=polyline&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe

reporting:
    - module: blazemeter
      report-name: OpenRouteService Directions API Concurrency Test