tests/taurus/directions/multi-profile-backend.yml
---
execution:
- concurrency: 200
  ramp-up: 2m
  hold-for: 20m
  scenario: routing

scenarios:
  routing:
    default-address: http://192.168.2.11:8080
    requests:
        - url: /ors/routes?coordinates=13.404954,52.52000659999999%7C2.3522219,48.856614&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=driving-car&units=km&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: driving-1000-km-Berlin-Paris-instructions
        - url: /ors/routes?coordinates=13.404954,52.52000659999999%7C2.3522219,48.856614&elevation=false&geometry=true&geometry_format=geojson&instructions=false&options=%7B%7D&preference=fastest&profile=driving-car&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: driving-1000-m-Berlin-Paris-no-instructions
        - url: /ors/routes?coordinates=13.404954,52.52000659999999%7C11.5819806,48.1351253&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=driving-car&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: driving-500-km-Berlin-Munich-instructions
        - url: /ors/routes?coordinates=13.404954,52.52000659999999%7C11.5819806,48.1351253&elevation=false&geometry=true&geometry_format=geojson&instructions=false&options=%7B%7D&preference=fastest&profile=driving-car&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: driving-500-km-Berlin-Munich-no-instructions
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.661249999999999,49.4737672&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=foot-walking&units=km&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: walking-10-km-Heidelberg-Schriesheim-instructions
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.661249999999999,49.4737672&elevation=false&geometry=true&geometry_format=geojson&instructions=false&options=%7B%7D&preference=fastest&profile=foot-walking&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: walking-10-m-Heidelberg-Schriesheim-no-instructions
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.673254,49.4483389&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=foot-walking&units=km&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: walking-6-km-Heidelberg-Dossenheim-instructions
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.673254,49.4483389&elevation=false&geometry=true&geometry_format=geojson&instructions=false&options=%7B%7D&preference=fastest&profile=foot-walking&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: walking-6-m-Heidelberg-Dossenheim-no-instructions
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.661249999999999,49.4737672&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=cycling-regular&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: cycling-10-Heidelberg-Schriesheim-elev-off
        - url: /ors/routes?coordinates=8.6724335,49.3987524%7C8.661249999999999,49.4737672&elevation=true&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=cycling-regular&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: cycling-10-Heidelberg-Schriesheim-elev-on
        - url: /ors/routes?coordinates=8.4036527,49.0068901%7C8.6724335,49.3987524&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=cycling-regular&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: cycling-50-Karlsruhe-Heidelberg-elev-off
        - url: /ors/routes?coordinates=8.4036527,49.0068901%7C8.6724335,49.3987524&elevation=true&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=cycling-regular&units=m&api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe
          label: cycling-50-Karlsruhe-Heidelberg-elev-on

reporting:
    - module: blazemeter
      report-name: OpenRouteService Directions API Concurrency Test