tests/taurus/directions/multi-profile-backend.yml
---
execution:
- concurrency: 30 
  ramp-up: 1m
  hold-for: 5m
  scenario: routing

scenarios:
  routing:
    requests:
        - url: http://192.168.2.11:8080/ors/routes?api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe&coordinates=8.048858642578127,46.39277144427804%7C7.743301391601563,47.53435623467226&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=driving-car&units=m
          label: driving
        - url: http://192.168.2.11:8080/ors/routes?api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe&coordinates=8.048858642578127,46.39277144427804%7C7.743301391601563,47.53435623467226&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=foot-walking&units=m
          label: walking
        - url: http://192.168.2.11:8080/ors/routes?api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe&coordinates=8.048858642578127,46.39277144427804%7C7.743301391601563,47.53435623467226&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=cycling-regular&units=m
          label: cycling

reporting:
    - module: blazemeter
      report-name: OpenRouteService Directions API Concurrency Test