tests/taurus/directions/walking-backend.yml
---
execution:
- concurrency: 500
  ramp-up: 1m
  hold-for: 5m
  scenario: walking

scenarios:
  walking:
    requests:
    - http://192.168.2.11:8080/ors/routes?api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe&coordinates=8.048858642578127,47.39277144427804%7C7.743301391601563,47.53435623467226&elevation=false&geometry=true&geometry_format=geojson&instructions=true&instructions_format=html&language=en&options=%7B%7D&preference=fastest&profile=foot-walking&units=m

reporting:
    - module: blazemeter
      report-name: OpenRouteService Directions API Concurrency Test